{
  "id": "doc_link",
  "name": "Document Link Sharing",
  "goal": "Access a private document",
  "brief": "Goal: Access a private document even though you weren’t intended to see it.\n\nA company sometimes shares internal docs via links set to “Anyone with the link can view.” Employees paste these links into emails, tickets, or chat. Filenames and folder names follow predictable project/date patterns. Some shared computers stay signed in or keep browser history.\n\nTask: Build an attack tree that shows realistic ways an unintended person could obtain and open the link. Use OR for alternatives and AND when multiple conditions must all be true.",
  "guideText": "Goal (root): Access a private document.\n\nContext:\n• “Anyone with link” sharing is occasionally used.\n• Links spread via email/chat/tickets; some get copied externally.\n• Filenames and folders use predictable patterns (project-code_YYYY-MM spec).\n• Shared devices/browsers may keep history or be left signed in.\n\nModel routes like:\n• Find the link where it leaked (forwarded email, pasted in public ticket, pasted in external chat).\n• Guess or predict a link from naming patterns or from nearby shared items.\n• Use a shared/sign-in-left-open device to retrieve the link from history or bookmarks.\n\nOut of scope: persuading an insider to hand over the link deliberately, deep platform exploits.",
  "gold_must_have": [
    "locate leaked link in message or ticket",
    "predict or enumerate link from naming pattern",
    "use shared device/browser history to recover link"
  ],
  "gold_low_value": [
    "ddos the drive service",
    "hack the provider’s servers",
    "malware on every employee laptop"
  ],
  "aliases": {
    "locate leaked link in message or ticket": [
      "forwarded email contains link",
      "public ticket pasted link",
      "chat paste exposed link",
      "pasteboard leaked link"
    ],
    "predict or enumerate link from naming pattern": [
      "guess doc link from name",
      "see nearby project folder names",
      "predict share url from pattern"
    ],
    "use shared device/browser history to recover link": [
      "find link in browser history",
      "shared kiosk signed in",
      "left logged in find link"
    ]
  }
}
