{
  "id": "iot",
  "name": "IoT Camera Local Access",
  "goal": "View live camera feed",
  "brief": "Goal: View live camera feed without permission.\n\nA home security camera can be viewed from a mobile app (cloud) and also exposes a local web/RTSP stream when you’re on the home Wi-Fi. Many users never change factory settings.\n\nTask: Build an attack tree that shows realistic ways to view the live feed. Use OR for alternatives and AND when multiple conditions must all be true.\n\nAssumptions:\n• Attacker is nearby and can try to join the home Wi-Fi.\n• The camera may still have default admin credentials or a simple stream key.\n• UPnP or port-forwarding may expose services accidentally.",
  "guideText": "Goal (root): View live camera feed.\n\nContext:\n• Local web UI / RTSP stream exists on the LAN.\n• Some cameras ship with default admin credentials (admin/admin or printed on sticker).\n• Wi-Fi password may be weak, reused, or shared widely.\n• Router settings (UPnP) may expose camera to the internet without the owner realizing.\n\nModel routes like:\n• Join the home Wi-Fi (e.g., weak password guess, shared guest pass) AND open the local camera page/RTSP.\n• Use default/weak camera credentials on the local page to see the feed.\n• If exposed to the internet by UPnP, access the camera remotely with default/weak creds or a simple stream key.\n\nOut of scope: advanced radio attacks, custom firmware, physical theft of the camera.",
  "gold_must_have": [
    "join home wifi then browse local camera",
    "use default or weak camera password",
    "remote access via upnp/port forward plus weak auth"
  ],
  "gold_low_value": [
    "ddos the camera",
    "break home router crypto",
    "reverse engineer firmware"
  ],
  "aliases": {
    "join home wifi then browse local camera": [
      "connect to wifi then open camera page",
      "on wifi view rtsp stream",
      "join network and view camera"
    ],
    "use default or weak camera password": [
      "default admin",
      "password is admin",
      "weak camera password",
      "printed sticker password"
    ],
    "remote access via upnp/port forward plus weak auth": [
      "internet exposed camera",
      "router upnp exposure",
      "open port to camera",
      "port forward camera weak password"
    ]
  }
}
